### Pandas_Fundamentals

In [2]:
#creating a pandas dataframe using a dictionary
import pandas as pd
student_data={
    'Name':['Alex','John','Nicole','Andrew'],
    'Class':[1,2,3,4],
    'Age':[16,17,17,18]
}

df_new=pd.DataFrame(student_data)
print(df_new)

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18

In [3]:
#Creating a dataframe from a dictionary with custom indexing
df_new=pd.DataFrame(student_data,index=['a','b','c','d'])
print(df_new)

     Name  Class  Age
a    Alex      1   16
b    John      2   17
c  Nicole      3   17
d  Andrew      4   18

In [8]:
#by default pandas will take a dictionary which will have a list as its value 
#if we have a dictionary which does not have a list for the values
house_data={
    'H1':12000,
    'H2':15323,
    'H3':18000
}
df_new=pd.DataFrame(house_data.items(),columns=['House','Cost'])#can also send a list of tuples
print(df_new)
print(type(df_new))

  House   Cost
0    H1  12000
1    H2  15323
2    H3  18000
<class 'pandas.core.frame.DataFrame'>

In [9]:
student_data={
    'Name':['Alex','John','Nicole','Andrew'],
    'Class':[1,2,3,4],
    'Age':[16,17,17,18]
}
#if we had a huge dictionary and we didnt want to use every column in the dataframe
new_df=pd.DataFrame(student_data,columns=['Name','Age'])
print(new_df)

     Name  Age
0    Alex   16
1    John   17
2  Nicole   17
3  Andrew   18

In [10]:
#if we wanted to change the orientation while creating the dataframe
new_df=pd.DataFrame.from_dict(student_data,orient='index')
print(new_df)

          0     1       2       3
Name   Alex  John  Nicole  Andrew
Class     1     2       3       4
Age      16    17      17      18

In [12]:
#Creating a Dataframe from a nested Dictionary
student_new={
    0:{
        'name':'Alex',
        'age':12,
        'class':5
    },
    1:{
        'name':'Andrew',
        'age':10,
        'class':4
    }
}


new_df=pd.DataFrame(student_new)
print(new_df)
new_df=new_df.transpose()
print(new_df)

          0       1
name   Alex  Andrew
age      12      10
class     5       4
     name age class
0    Alex  12     5
1  Andrew  10     4

In [19]:
#Creating an empty Dataframe and then appending rows and columns to it
new_df=pd.DataFrame(columns=['Name','Age','Marks'])
print(new_df)#printing an empty dataframe

Empty DataFrame
Columns: [Name, Age, Marks]
Index: []

In [16]:
#we can now append values inside this empty df
new_df.append({'Name':'alex','Age':12,'Marks':33},ignore_index=True)#no change in the new_df
print(new_df)

Empty DataFrame
Columns: [Name, Age, Marks]
Index: []

In [20]:
new_df=new_df.append({'Name':'alex','Age':12,'Marks':33},ignore_index=True)#ignore_index=True because we are appending a series object to the df
new_df=new_df.append({'Name':'andrew','Age':22,'Marks':43},ignore_index=True)
new_df=new_df.append({'Name':'June','Age':32,'Marks':13},ignore_index=True)
print(new_df)

     Name Age Marks
0    alex  12    33
1  andrew  22    43
2    June  32    13

In [22]:
#appending a new column to the df
new_df['Area_code']=[1,2,3]
print(new_df)#added a new column to the dataframe.

     Name Age Marks  Area_code
0    alex  12    33          1
1  andrew  22    43          2
2    June  32    13          3

In [27]:
#creating an empty dataframe with all NaN
new_df=pd.DataFrame(index=[0,1,2],columns=['a','b','c'])
print(new_df)
#appending values in the dataframe
new_df.loc[0]=[1,2,3]#appending the row
print(new_df)
new_df.loc[1]=[12,12,13]
print(new_df)

     a    b    c
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN
     a    b    c
0    1    2    3
1  NaN  NaN  NaN
2  NaN  NaN  NaN
     a    b    c
0    1    2    3
1   12   12   13
2  NaN  NaN  NaN

In [29]:
#converting a list to a dictionary.
l1=[['Alex',12,4],['Andrew',23,4],['June',3,12]]
new_df=pd.DataFrame(l1)
print(l1)
print(new_df)

[['Alex', 12, 4], ['Andrew', 23, 4], ['June', 3, 12]]
        0   1   2
0    Alex  12   4
1  Andrew  23   4
2    June   3  12

In [30]:
new_df=pd.DataFrame.from_records(l1,exclude=['Age'],columns=['Name','Age','Grade'])
print(new_df)#we can do this by passing a list of tuples as well

     Name  Grade
0    Alex      4
1  Andrew      4
2    June     12

In [31]:
#We can also have a number of lists containing the values of each columns
Names=['Alex','June','Jane']
Age=[1,3,44]
grade=[12,15,17]

zipped_folder=list(zip(Names,Age,grade))
print(zipped_folder)

new_df=pd.DataFrame(zipped_folder,columns=['Name','Age','Grade'])
print(new_df)

[('Alex', 1, 12), ('June', 3, 15), ('Jane', 44, 17)]
   Name  Age  Grade
0  Alex    1     12
1  June    3     15
2  Jane   44     17

In [36]:
#reading a csv file into a dataframe
new_df=pd.read_csv('./samplenp_new.csv') #sep='\s+' one or more whitespace
print(new_df)
#while reading certain csv files if we wish to skip some of the top and or bottom rows we can use skiprows and skipfooter
#in pd.read_csv()

   1  2  3
0  4  5  6

In [42]:
#selecting rows/columns from a dataframe
student_data={
    'Name':['Alex','John','Nicole','Andrew'],
    'Class':[1,2,3,4],
    'Age':[16,17,17,18]
}

new_df=pd.DataFrame(student_data,columns=['Name','Class','Age'])
print(new_df)

#If we wish to select/index the dataframe via column names we can use the df.loc()
#Basic syntax is df.loc[row_name range,column_name range]
print(new_df.loc[:,['Name','Age']])
#if we wish to only select a single row of the dataframe using loc
print(new_df.loc[0,:])
#we can pass a range as well
print(new_df.loc[0:2,:])

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
     Name  Age
0    Alex   16
1    John   17
2  Nicole   17
3  Andrew   18
Name     Alex
Class       1
Age        16
Name: 0, dtype: object
     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17

In [45]:
#just how we use df.loc[] to select rows and columns based on their names we can use the df.iloc[] which has the same syntax
#only difference is that instead of giving the names we give index 
print(new_df.iloc[0:2,0:2])

   Name  Class
0  Alex      1
1  John      2

In [46]:
#we can also select entire columns of the dataframe using the []
print(new_df['Name'])
#we can also select multiple columns of the dataframe
print(new_df[['Name','Age']])

0      Alex
1      John
2    Nicole
3    Andrew
Name: Name, dtype: object
     Name  Age
0    Alex   16
1    John   17
2  Nicole   17
3  Andrew   18

In [3]:
import pandas as pd
#selecting rows based on some condition in pandas.
student_data={
    'Name':['Alex','John','Nicole','Andrew','Alex','Jane','Ash','Misty'],
    'Class':[1,2,3,4,4,1,12,3],
    'Age':[16,17,17,18,12,13,55,66]
}
new_df=pd.DataFrame(student_data,columns=['Name','Class','Age'])
print(new_df)

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4    Alex      4   12
5    Jane      1   13
6     Ash     12   55
7   Misty      3   66

In [49]:
#consider we wanted to select the rows where name='Alex'
print(new_df[new_df['Name']=='Alex'])
print(new_df['Name']=='Alex')

   Name  Class  Age
0  Alex      1   16
4  Alex      4   12
0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: Name, dtype: bool

In [50]:
#selecting rows based on multiple options
#suppose we wanted the rows where the class is either 1 or 3
print(new_df[new_df['Class'].isin([1,3])])#will print all the rows where class is either 1 or 3

     Name  Class  Age
0    Alex      1   16
2  Nicole      3   17
5    Jane      1   13
7   Misty      3   66

In [51]:
#slecting rows based off multiple conditions on columns
print(new_df[(new_df['Age']>16) & (new_df['Class']>3)])

     Name  Class  Age
3  Andrew      4   18
6     Ash     12   55

In [53]:
#finding minimum values across rows and columns and their index positions
#we can find the minimum value across each column as
print(new_df.min())#by default will check across columns
print(new_df.min(axis=1))#finiding the minimum value across each row 
#by default skipna=True if we wish to find the minimum withought skipping the NaN values set skipna=False

Name     Alex
Class       1
Age        12
dtype: object
0     1
1     2
2     3
3     4
4     4
5     1
6    12
7     3
dtype: int64

In [54]:
#to find the min value only along selected columns
print(new_df[['Age','Class']].min())

Age      12
Class     1
dtype: int64

In [6]:
#to find the index of the minimum value in the dataframe
print(type(new_df))
print(new_df.idxmin)

<class 'pandas.core.frame.DataFrame'>
<bound method DataFrame.idxmin of      Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4    Alex      4   12
5    Jane      1   13
6     Ash     12   55
7   Misty      3   66>

In [7]:
#Get the unique values from a dataframe
print(new_df.nunique())#number of unique entries present
print(new_df['Name'].unique())#printing the unique entries in the Name column
print(new_df[['Name','Age']].nunique())

Name     7
Class    5
Age      7
dtype: int64
['Alex' 'John' 'Nicole' 'Andrew' 'Jane' 'Ash' 'Misty']
Name    7
Age     7
dtype: int64

In [77]:
#selecting first or last N rows in the dataframe.
print(new_df.head())
print(new_df.tail())
print(new_df[['Name','Age']].head())

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4    Alex      4   12
     Name  Class  Age
3  Andrew      4   18
4    Alex      4   12
5    Jane      1   13
6     Ash     12   55
7   Misty      3   66
     Name  Age
0    Alex   16
1    John   17
2  Nicole   17
3  Andrew   18
4    Alex   12

In [82]:
#Get the list of rownames and columnames of the dataframe
print(list(new_df.columns.values))
print(list(new_df.index.values))

['Name', 'Class', 'Age']
[0, 1, 2, 3, 4, 5, 6, 7]

In [90]:
#convert a Dataframe into a list of lists.
print(new_df.to_numpy())#converts our dataframe to a nested numpy array
print(new_df.to_numpy().tolist())
print(type(new_df.to_numpy().tolist()))

[['Alex' 1 16]
 ['John' 2 17]
 ['Nicole' 3 17]
 ['Andrew' 4 18]
 ['Alex' 4 12]
 ['Jane' 1 13]
 ['Ash' 12 55]
 ['Misty' 3 66]]
[['Alex', 1, 16], ['John', 2, 17], ['Nicole', 3, 17], ['Andrew', 4, 18], ['Alex', 4, 12], ['Jane', 1, 13], ['Ash', 12, 55], ['Misty', 3, 66]]
<class 'list'>

In [120]:
#Droping rows of a dataframe
print(new_df)
#drop row with index 1
# print(new_df.drop(1))
# print(new_df)#by default the df.drop() will not remove the row from the dataframe 
#new_df.drop([1,2],inplace=True)
#print(new_df)
print(new_df.index.values)
print(new_df.drop(index=[0,1],inplace=True,axis=1))

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4    Alex      4   12
5    Jane      1   13
6     Ash     12   55
7   Misty      3   66
[0 1 2 3 4 5 6 7]
None

In [121]:
print(new_df)

     Name  Class  Age
2  Nicole      3   17
3  Andrew      4   18
4    Alex      4   12
5    Jane      1   13
6     Ash     12   55
7   Misty      3   66

In [34]:
#Droping rows based on column values
import pandas as pd
student_data={
    'Name':['Alex','John','Nicole','Andrew'],
    'Class':[1,2,3,4],
    'Age':[16,17,17,18]
}
print(student_data)
stu_df=pd.DataFrame(student_data)
print(stu_df[stu_df['Class']==1].index,stu_df[stu_df['Class']==1])#we can get the index of the rows which satisfy the condition\
stu_df.drop(stu_df[stu_df['Class']==1].index,axis=0,inplace=True)#axis=0  deleted the row based on column condition
print(stu_df)

#deleting columns based on multiple column conditions 
#deleting name=John and age =18

stu_df.drop(stu_df[(stu_df['Name']=='John') | (stu_df['Age']==18)].index,inplace=True,axis=0)
stu_df#dropping multiple rows based on multiple conditions on different rows on a dataframe

{'Name': ['Alex', 'John', 'Nicole', 'Andrew'], 'Class': [1, 2, 3, 4], 'Age': [16, 17, 17, 18]}
Int64Index([0], dtype='int64')    Name  Class  Age
0  Alex      1   16
     Name  Class  Age
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18

     Name  Class  Age
2  Nicole      3   17

In [35]:
student_data={
    'Name':['Alex','John','Nicole','Andrew'],
    'Class':[1,2,3,4],
    'Age':[16,17,17,18]
}
#dropping Name column from the dataframe
new_df=pd.DataFrame(student_data)
new_df.drop(['Name','Age'],axis='columns')#dropping multiple columns from our dataframe

   Class
0      1
1      2
2      3
3      4

In [37]:
#dropping column if exists
if 'Class' in new_df.columns:
    new_df.drop(['Class'],axis='columns',inplace=True)
else:
    print('not found!')
print(new_df)

     Name  Age
0    Alex   16
1    John   17
2  Nicole   17
3  Andrew   18

In [59]:
#drop rows in a dataframe containing missing values or NaN
import numpy as np
student_data={
    'Name':['Alex',np.NaN,'Nicole','Andrew','silva'],
    'Class':[1,np.NaN, np.NaN,4,5],
    'Age':[16,np.NaN,17,18,np.NaN]
}
new_df=pd.DataFrame(student_data)
print(new_df)#we can see one row contains all columns as NaN
print(f'\n {new_df.dropna()}')

     Name  Class   Age
0    Alex    1.0  16.0
1     NaN    NaN   NaN
2  Nicole    NaN  17.0
3  Andrew    4.0  18.0
4   silva    5.0   NaN

      Name  Class   Age
0    Alex    1.0  16.0
3  Andrew    4.0  18.0

In [60]:
print(new_df.dropna(how='any'))

     Name  Class   Age
0    Alex    1.0  16.0
3  Andrew    4.0  18.0

In [61]:
print(new_df.dropna(how='all'))#only the row with all the column values as NaN is deleted

     Name  Class   Age
0    Alex    1.0  16.0
2  Nicole    NaN  17.0
3  Andrew    4.0  18.0
4   silva    5.0   NaN

In [62]:
print(new_df.dropna(how='any',subset=['Class','Name']))#deleting based on only certain columns

     Name  Class   Age
0    Alex    1.0  16.0
3  Andrew    4.0  18.0
4   silva    5.0   NaN

In [66]:
print(new_df.dropna(thresh=2))#setting the threshold to delete any row with n number of NaN values in it

     Name  Class   Age
0    Alex    1.0  16.0
2  Nicole    NaN  17.0
3  Andrew    4.0  18.0
4   silva    5.0   NaN

In [79]:
#adding new columns to a dataframe.
student_data={
    'Name':['Alex','John','Nicole','Andrew'],
    'Class':[1,2,3,4],
    'Age':[16,17,17,18]
}
new_df=pd.DataFrame(student_data)
#adding a new column to the dataframe
new_df['Marks']=[11,14,15,66]
print(new_df)
#we can also set default values to the new column so that each row will get the same value
new_df['internal']=20
print(new_df)
#we can also create a new  column based on existing column values
new_df['Total']=(new_df['Marks']+new_df['internal'])
print(new_df)
#we can also use the df.assign() using the [] will throw a value error 
new_mod=new_df.assign(grade=['D','D','D','A'])
print(new_mod)
print(new_df)#not changed

     Name  Class  Age  Marks
0    Alex      1   16     11
1    John      2   17     14
2  Nicole      3   17     15
3  Andrew      4   18     66
     Name  Class  Age  Marks  internal
0    Alex      1   16     11        20
1    John      2   17     14        20
2  Nicole      3   17     15        20
3  Andrew      4   18     66        20
     Name  Class  Age  Marks  internal  Total
0    Alex      1   16     11        20     31
1    John      2   17     14        20     34
2  Nicole      3   17     15        20     35
3  Andrew      4   18     66        20     86
     Name  Class  Age  Marks  internal  Total grade
0    Alex      1   16     11        20     31     D
1    John      2   17     14        20     34     D
2  Nicole      3   17     15        20     35     D
3  Andrew      4   18     66        20     86     A
     Name  Class  Age  Marks  internal  Total
0    Alex      1   16     11        20     31
1    John      2   17     14        20     34
2  Nicole      3   17     15        20     35
3  Andrew      4   18     66        20     86

In [83]:
#adding rows into a dataframe
new_mod_df=new_mod.append({'Name':'Jane','Class':4,'Age':19},ignore_index=True)
print(new_mod_df)#we are getting the correct index as we have passed ignore_index as true and also whichever columns do not have a value
#in the dictionary will be set as a NaN value in the dataframe it will not modify the dataframe but will return a new modified dataframe
#using this we can also append a row of one df into a different dataframe.
new_mod_df.loc[2]=['Alex jr',4,22,44,33,44,'B']
new_mod_df

     Name  Class  Age  Marks  internal  Total grade
0    Alex      1   16   11.0      20.0   31.0     D
1    John      2   17   14.0      20.0   34.0     D
2  Nicole      3   17   15.0      20.0   35.0     D
3  Andrew      4   18   66.0      20.0   86.0     A
4    Jane      4   19    NaN       NaN    NaN   NaN

      Name  Class  Age  Marks  internal  Total grade
0     Alex      1   16   11.0      20.0   31.0     D
1     John      2   17   14.0      20.0   34.0     D
2  Alex jr      4   22   44.0      33.0   44.0     B
3   Andrew      4   18   66.0      20.0   86.0     A
4     Jane      4   19    NaN       NaN    NaN   NaN

In [84]:
#finding elements in a dataframe.
new_mod_df.values

array([['Alex', 1, 16, 11.0, 20.0, 31.0, 'D'],
       ['John', 2, 17, 14.0, 20.0, 34.0, 'D'],
       ['Alex jr', 4, 22, 44.0, 33.0, 44.0, 'B'],
       ['Andrew', 4, 18, 66.0, 20.0, 86.0, 'A'],
       ['Jane', 4, 19, nan, nan, nan, nan]], dtype=object)

In [85]:
if 'Jane' in new_mod_df.values:
    print('Jane present')

Jane present

In [89]:
new_mod_df.isin([20])#we can see it is present in our dataframe

    Name  Class    Age  Marks  internal  Total  grade
0  False  False  False  False      True  False  False
1  False  False  False  False      True  False  False
2  False  False  False  False     False  False  False
3  False  False  False  False      True  False  False
4  False  False  False  False     False  False  False

In [90]:
new_mod_df.isin([20]).any()#will tell us which column\columns contain the value

Name        False
Class       False
Age         False
Marks       False
internal     True
Total       False
grade       False
dtype: bool

In [91]:
new_mod_df.isin([20]).any().any()#is the value present anywhere

True

In [104]:
#finding and dropping duplicate rows and columns in pandas.
student_data={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
new_df=pd.DataFrame(student_data)
new_df#We have two rows which are duplicates
new_df['Vals']=[16,17,17,18,12,12]
print(new_df)

print(new_df.drop_duplicates())#by default it will drop the duplicate row from the dataframe and keep the first occurance

column=new_df.loc[:,'Age']
other_column=new_df.loc[:,'Vals']

if column.equals(other_column):
    print('equal')
new_df.drop(columns=['Vals'])#dropping duplicate column

     Name  Class  Age  Vals
0    Alex      1   16    16
1    John      2   17    17
2  Nicole      3   17    17
3  Andrew      4   18    18
4     joe     12   12    12
5     joe     12   12    12
     Name  Class  Age  Vals
0    Alex      1   16    16
1    John      2   17    17
2  Nicole      3   17    17
3  Andrew      4   18    18
4     joe     12   12    12
equal

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12

In [105]:
#how to check if a dataframe is empty
new_df.empty

False

In [106]:
len(new_df)

6

In [108]:
len(new_df.index.values)

6

In [110]:
new_df.index.values

array([0, 1, 2, 3, 4, 5], dtype=int64)

In [111]:
new_df[new_df.duplicated()]#if we wanted to find the duplicated row we can use the duplicated() 
#this is based on all the columns of the dataframe.

  Name  Class  Age  Vals
5  joe     12   12    12

In [114]:
new_df[new_df.duplicated(['Age'])]#finding the duplicated rows except the first occurance from the dataframe based on a specific column

     Name  Class  Age  Vals
2  Nicole      3   17    17
5     joe     12   12    12

In [115]:
#finding the max value in the dataframe
new_df.max()#finding the max in the dataframe wrt columns

Name     joe
Class     12
Age       18
Vals      18
dtype: object

In [116]:
new_df.max(axis=1)#finding the max in the dataframe wrt rows

0    16
1    17
2    17
3    18
4    12
5    12
dtype: int64

In [123]:
#new_df.idxmax(skipna=True)]
#to get the index position

In [138]:
#finding the index of an element in pandas
print(new_df)
print(new_df.isin([3]))
column_list=new_df.isin([3]).any()
column_list
new_list=list(column_list[column_list==True].index)
new_list#we have the columns which have the value 3
bool_mat=new_df.isin([3])
for col in new_list:
    rows=list(bool_mat[col][bool_mat[col]==True].index)
    for row in rows:
        print(f'row {row} columns {col} ')

     Name  Class  Age  Vals
0    Alex      1   16    16
1    John      2   17    17
2  Nicole      3   17    17
3  Andrew      4   18    18
4     joe     12   12    12
5     joe     12   12    12
    Name  Class    Age   Vals
0  False  False  False  False
1  False  False  False  False
2  False   True  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
row 2 columns Class

In [169]:
#Modify a dataframe
#pandas apply()
student_data={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
new_df=pd.DataFrame(student_data)
#we can use the dataframe.apply() to run a function on rows and columns of the dataframe
#we can set axis=0 applies the function on columns axis=1 rows
print(new_df.apply(lambda x: x*2,axis=0))
print(new_df.apply(lambda x: x*3,axis=1))
#we can also pass in a user defined function just as how we are passing in a lambda function.
#we can also call a numpy function ]
print(new_df.apply(np.sum))

           Name  Class  Age
0      AlexAlex      2   32
1      JohnJohn      4   34
2  NicoleNicole      6   34
3  AndrewAndrew      8   36
4        joejoe     24   24
5        joejoe     24   24
                 Name  Class  Age
0        AlexAlexAlex      3   48
1        JohnJohnJohn      6   51
2  NicoleNicoleNicole      9   51
3  AndrewAndrewAndrew     12   54
4           joejoejoe     36   36
5           joejoejoe     36   36
Name     AlexJohnNicoleAndrewjoejoe
Class                            34
Age                              92
dtype: object

In [170]:
student_data={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
new_df=pd.DataFrame(student_data)
#sorting a dataframe
new_df.sort_values(by=['Age'])

     Name  Class  Age
4     joe     12   12
5     joe     12   12
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18

In [171]:
#using the apply() on only specific rows
new_df['Class']=new_df['Class'].apply(lambda x:x+10)
new_df#apply function applied only to the Class column

#in the same way if we wanted to use the apply function on a single row then we have to do somehting like this
new_df.drop(columns=['Name'],inplace=True)
new_df.loc[1]=new_df.loc[1].apply(np.square)
new_df

   Class  Age
0     11   16
1    144  289
2     13   17
3     14   18
4     22   12
5     22   12

In [172]:
new_df=new_df.apply(lambda x:x+10 if x.name in ['Class'] else x)
new_df
#same way set axis=1 for rows and select rows in the dataframe.

   Class  Age
0     21   16
1    154  289
2     23   17
3     24   18
4     32   12
5     32   12

In [174]:
#changing the datatype of pandas dataframe
print(new_df.dtypes)
new_df['Class']=new_df['Class'].astype('float32')
new_df['Age']=new_df['Age'].astype('object')
print(new_df.dtypes)

Class    float32
Age       object
dtype: object
Class    float32
Age       object
dtype: object

In [176]:
#if we wish to convert the datatypes of multiple columns then we can pass a dictionary into the astype()
new_df=new_df.astype({'Class':'int64','Age':'int64'})
new_df.dtypes

Class    int64
Age      int64
dtype: object

In [3]:
#changing column names of the dataframe
name_list=new_df.columns.values#use index.values for row names
name_list[0]='Rank'
new_df

NameError: name 'new_df' is not defined

In [2]:
new_df['dob']=['29/10/1988',
'23/11/1981' ,
'10/04/1982',
'21/05/1983',
'16/08/1984',
'11/10/1998']

NameError: name 'new_df' is not defined

In [185]:
new_df

   Rank  Age         dob
0    21   16  29/10/1988
1   154  289  23/11/1981
2    23   17  10/04/1982
3    24   18  21/05/1983
4    32   12  16/08/1984
5    32   12  11/10/1998

In [188]:
#we need to convert this date time which is a string right now into a datetime object
print(new_df.dtypes)
new_df['dob']=pd.to_datetime(new_df['dob'])
print(new_df.dtypes)
print(new_df)

Rank             int64
Age              int64
dob     datetime64[ns]
dtype: object
Rank             int64
Age              int64
dob     datetime64[ns]
dtype: object
   Rank  Age        dob
0    21   16 1988-10-29
1   154  289 1981-11-23
2    23   17 1982-10-04
3    24   18 1983-05-21
4    32   12 1984-08-16
5    32   12 1998-11-10

In [204]:
#setting a column of a dataframe as the index 
new_df['Indx']=list(range(0,6))
print(new_df)
print(new_df.set_index('Indx',drop=False))
print(new_df.set_index('Indx'))
print(new_df.set_index('Rank',append=True))#multi index

   Rank  Age        dob  Indx
0    21   16 1988-10-29     0
1   154  289 1981-11-23     1
2    23   17 1982-10-04     2
3    24   18 1983-05-21     3
4    32   12 1984-08-16     4
5    32   12 1998-11-10     5
      Rank  Age        dob  Indx
Indx
0       21   16 1988-10-29     0
1      154  289 1981-11-23     1
2       23   17 1982-10-04     2
3       24   18 1983-05-21     3
4       32   12 1984-08-16     4
5       32   12 1998-11-10     5
      Rank  Age        dob
Indx
0       21   16 1988-10-29
1      154  289 1981-11-23
2       23   17 1982-10-04
3       24   18 1983-05-21
4       32   12 1984-08-16
5       32   12 1998-11-10
        Age        dob  Indx
  Rank
0 21     16 1988-10-29     0
1 154   289 1981-11-23     1
2 23     17 1982-10-04     2
3 24     18 1983-05-21     3
4 32     12 1984-08-16     4
5 32     12 1998-11-10     5

In [201]:
new_df.dtypes

Rank             int64
Age              int64
dob     datetime64[ns]
Indx             int64
dtype: object

In [205]:
#reseting the index
new_df.reset_index()#will reset the multi index using reset_inedx()

   index  Rank  Age        dob  Indx
0      0    21   16 1988-10-29     0
1      1   154  289 1981-11-23     1
2      2    23   17 1982-10-04     2
3      3    24   18 1983-05-21     3
4      4    32   12 1984-08-16     4
5      5    32   12 1998-11-10     5

In [ ]:
#Merging two dataframes.
#use the df1.merge(df2,how=?)

In [209]:
#counting the number of NaN or missing values in a df
new_df.isnull().sum()

Rank    0
Age     0
dob     0
Indx    0
dtype: int64

In [210]:
new_df.index

RangeIndex(start=0, stop=6, step=1)

In [218]:
for i in list(range(len(new_df.index))):
    print(f'number of nulls in row {i} is {new_df.iloc[i].isnull().sum()}')#checking the number of nulls present in every row of our dataframe

number of nulls in row 0 is 0
number of nulls in row 1 is 0
number of nulls in row 2 is 0
number of nulls in row 3 is 0
number of nulls in row 4 is 0
number of nulls in row 5 is 0

In [220]:
#counting the number of rows in our dataframe
print(new_df.shape)
print(len(new_df.index))

(6, 4)
6

In [230]:
#counting the number of rows based off a certain condition.
#as an example counting the number of rows in our dataframe where the class > 2

series_obj=new_df.apply(lambda x: True if x['Age']<18 else False,axis=1)#searching rowwise
print(series_obj)
len(series_obj[series_obj==True].index)#this gives us the number of rows in our dataframe where the age < 18

0     True
1    False
2     True
3    False
4     True
5     True
dtype: bool

4

In [1]:
new_df

NameError: name 'new_df' is not defined

In [232]:
#Iterating over the contents of the dataframe.
#looping through the dataframe using df.iterrows()
for (index_label,row_series) in new_df.iterrows():
    print(f'index is {index_label}')
    print(f'Content of the series {row_series}')

index is 0
Content of the series Rank                     21
Age                      16
dob     1988-10-29 00:00:00
Indx                      0
Name: 0, dtype: object
index is 1
Content of the series Rank                    154
Age                     289
dob     1981-11-23 00:00:00
Indx                      1
Name: 1, dtype: object
index is 2
Content of the series Rank                     23
Age                      17
dob     1982-10-04 00:00:00
Indx                      2
Name: 2, dtype: object
index is 3
Content of the series Rank                     24
Age                      18
dob     1983-05-21 00:00:00
Indx                      3
Name: 3, dtype: object
index is 4
Content of the series Rank                     32
Age                      12
dob     1984-08-16 00:00:00
Indx                      4
Name: 4, dtype: object
index is 5
Content of the series Rank                     32
Age                      12
dob     1998-11-10 00:00:00
Indx                      5
Name: 5, dtype: object

In [15]:
import pandas as pd
student_data={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
new_df=pd.DataFrame(student_data)
new_df

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12

In [5]:
for items in new_df.itertuples():
    print(items)

Pandas(Index=0, Name='Alex', Class=1, Age=16)
Pandas(Index=1, Name='John', Class=2, Age=17)
Pandas(Index=2, Name='Nicole', Class=3, Age=17)
Pandas(Index=3, Name='Andrew', Class=4, Age=18)
Pandas(Index=4, Name='joe', Class=12, Age=12)
Pandas(Index=5, Name='joe', Class=12, Age=12)

In [7]:
for items in new_df.itertuples():
    print(items._asdict())#return a dictionary as the result

OrderedDict([('Index', 0), ('Name', 'Alex'), ('Class', 1), ('Age', 16)])
OrderedDict([('Index', 1), ('Name', 'John'), ('Class', 2), ('Age', 17)])
OrderedDict([('Index', 2), ('Name', 'Nicole'), ('Class', 3), ('Age', 17)])
OrderedDict([('Index', 3), ('Name', 'Andrew'), ('Class', 4), ('Age', 18)])
OrderedDict([('Index', 4), ('Name', 'joe'), ('Class', 12), ('Age', 12)])
OrderedDict([('Index', 5), ('Name', 'joe'), ('Class', 12), ('Age', 12)])

In [14]:
print(new_df)#changing the values of a column while iterating through the dataframe
for row_idx,value in new_df.iterrows():
    new_df.at[row_idx,'Age']=value['Age']+10
print(new_df)

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12
     Name  Class  Age
0    Alex      1   26
1    John      2   27
2  Nicole      3   27
3  Andrew      4   28
4     joe     12   22
5     joe     12   22

In [16]:
for column_names,column_data in new_df.iterrows():
    print(column_names)
    print(column_data)

0
Name     Alex
Class       1
Age        16
Name: 0, dtype: object
1
Name     John
Class       2
Age        17
Name: 1, dtype: object
2
Name     Nicole
Class         3
Age          17
Name: 2, dtype: object
3
Name     Andrew
Class         4
Age          18
Name: 3, dtype: object
4
Name     joe
Class     12
Age       12
Name: 4, dtype: object
5
Name     joe
Class     12
Age       12
Name: 5, dtype: object

In [17]:
#Display the entire dataframe (no truncation)
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [14]:
import pandas as pd
#sorting a pandas dataframe
student_data={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
#we have 2 functions to sort a pandas dataframe
#sort_values() using which we can sort the pandas dataframe by one or more columns
#sort_index() using which we can sort the dataframe by rows
df=pd.DataFrame(student_data)
print(df)
sorted_df=df.sort_values(by='Name',ascending=True,inplace=False)#sorting the dataframe in ascending order inplace=false as we do not want to change the original dataframe
print(sorted_df)
df.sort_values(by=['Age','Name'],ascending=True,inplace=True)#when we are using df.sort_values for multiple columns we are sorting first by 'Age' and then by 'Name'
print(df)
#we can also sort again by row index doing so will in this case give us the original dataframe back 
df.sort_index(inplace=True)
print(df)

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12
     Name  Class  Age
0    Alex      1   16
3  Andrew      4   18
1    John      2   17
2  Nicole      3   17
4     joe     12   12
5     joe     12   12
     Name  Class  Age
4     joe     12   12
5     joe     12   12
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12

In [20]:
#Merging dataframes in python
#we will use this when we have data coming in from multiple sources
#two main functions to work with concat and merge
#use concat when we want to combine two dataframes by rows or by column
#use merge whenw we want to combine two dataframes based on some common column
student_data_1={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
student_data_2={
    'Name':['Andy','Panda','Josh','Andrew','Sam','Will'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
df_1=pd.DataFrame(student_data_1)
df_2=pd.DataFrame(student_data_2)
print(df_1)
print(df_2)

df_3=pd.concat([df_1,df_2])
print(df_3)

df_4=pd.concat([df_1,df_2],keys=['a','b'])
print(df_4)
print(df_4.loc['a'])

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12
     Name  Class  Age
0    Andy      1   16
1   Panda      2   17
2    Josh      3   17
3  Andrew      4   18
4     Sam     12   12
5    Will     12   12
     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12
0    Andy      1   16
1   Panda      2   17
2    Josh      3   17
3  Andrew      4   18
4     Sam     12   12
5    Will     12   12
       Name  Class  Age
a 0    Alex      1   16
  1    John      2   17
  2  Nicole      3   17
  3  Andrew      4   18
  4     joe     12   12
  5     joe     12   12
b 0    Andy      1   16
  1   Panda      2   17
  2    Josh      3   17
  3  Andrew      4   18
  4     Sam     12   12
  5    Will     12   12
     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12

In [33]:
student_data_1={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
student_data_2={
    'Name':['Andy','Panda','Josh','Andrew','Sam','Will'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12],
    'Extra':[1,1,1,1,1,1]
}
df_1=pd.DataFrame(student_data_1,index=[0,1,2,3,4,5])
df_2=pd.DataFrame(student_data_2,index=[2,3,4,6,7,8])

print(df_1)
print(df_2)

sorted_new_1=pd.concat([df_1,df_2],axis=0)#axis=0 by row
print(sorted_new_1)
sorted_new_2=pd.concat([df_1,df_2],axis=1)#axis=1 by column by default join='outer'
print(sorted_new_2)
sorted_new_3=pd.concat([df_1,df_2],axis=1,join='inner')
print(sorted_new_3)

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12
     Name  Class  Age  Extra
2    Andy      1   16      1
3   Panda      2   17      1
4    Josh      3   17      1
6  Andrew      4   18      1
7     Sam     12   12      1
8    Will     12   12      1
   Age  Class  Extra    Name
0   16      1    NaN    Alex
1   17      2    NaN    John
2   17      3    NaN  Nicole
3   18      4    NaN  Andrew
4   12     12    NaN     joe
5   12     12    NaN     joe
2   16      1    1.0    Andy
3   17      2    1.0   Panda
4   17      3    1.0    Josh
6   18      4    1.0  Andrew
7   12     12    1.0     Sam
8   12     12    1.0    Will
     Name  Class   Age    Name  Class   Age  Extra
0    Alex    1.0  16.0     NaN    NaN   NaN    NaN
1    John    2.0  17.0     NaN    NaN   NaN    NaN
2  Nicole    3.0  17.0    Andy    1.0  16.0    1.0
3  Andrew    4.0  18.0   Panda    2.0  17.0    1.0
4     joe   12.0  12.0    Josh    3.0  17.0    1.0
5     joe   12.0  12.0     NaN    NaN   NaN    NaN
6     NaN    NaN   NaN  Andrew    4.0  18.0    1.0
7     NaN    NaN   NaN     Sam   12.0  12.0    1.0
8     NaN    NaN   NaN    Will   12.0  12.0    1.0
     Name  Class  Age   Name  Class  Age  Extra
2  Nicole      3   17   Andy      1   16      1
3  Andrew      4   18  Panda      2   17      1
4     joe     12   12   Josh      3   17      1

e:\myenv\lib\site-packages\ipykernel_launcher.py:18: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [35]:
student_data_1={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,12,12],
    'Age':[16,17,17,18,12,12]
}
student_data_2={
    'Class':[1,2,3,4,12,12],
    'Test_score':[66,57,37,28,22,22]
}
df_1=pd.DataFrame(student_data_1)
df_2=pd.DataFrame(student_data_2)
print(df_1)
print(df_2)

#simmilar to working with sql 

df_3=pd.merge(df_1,df_2,on='Class')

print(df_3)

     Name  Class  Age
0    Alex      1   16
1    John      2   17
2  Nicole      3   17
3  Andrew      4   18
4     joe     12   12
5     joe     12   12
   Class  Test_score
0      1          66
1      2          57
2      3          37
3      4          28
4     12          22
5     12          22
     Name  Class  Age  Test_score
0    Alex      1   16          66
1    John      2   17          57
2  Nicole      3   17          37
3  Andrew      4   18          28
4     joe     12   12          22
5     joe     12   12          22
6     joe     12   12          22
7     joe     12   12          22

In [40]:
#we can also do inner join outer join left and right outer join using how
df_4=pd.merge(df_1,df_2,on='Class',how='inner')
print(df_4)

     Name  Class  Age  Test_score
0    Alex      1   16          66
1    John      2   17          57
2  Nicole      3   17          37
3  Andrew      4   18          28
4     joe     12   12          22
5     joe     12   12          22
6     joe     12   12          22
7     joe     12   12          22

In [54]:
#working with the apply functions with your dataframe
#apply functions are very useful during the feature enggineering stage instead of using a forloop and iteraing through your dataframe
student_data_1={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,2,4],
    'Age':[16,17,17,18,12,12]
}
student_data_2={
    'Class':[1,2,3,4,12,12],
    'Test_score':[66,57,37,28,22,22]
}
df_1=pd.DataFrame(student_data_1)
df_2=pd.DataFrame(student_data_2)
#simmilar to working with sql 

df_3=pd.merge(df_1,df_2,on='Class')

def in_ten_years(x):
    return x+10

print(df_3.apply(lambda x:x))#will print every object the apply function is traversing through
print(df_3.apply(lambda x:x[0]))#will print the first row details
print(df_3.apply(lambda x:x[0],axis=1))#will print the first column
print(df_3.apply(lambda x:x['Class'],axis=1))#instead of selecting by index we can also select by column name in this manner
print(df_3['Age'].apply(lambda x: in_ten_years(x)))#how to use the apply function to change a single column of the dataframe

     Name  Class  Age  Test_score
0    Alex      1   16          66
1    John      2   17          57
2  Nicole      3   17          37
3  Andrew      4   18          28
4     joe     12   12          22
5     joe     12   12          22
6     joe     12   12          22
7     joe     12   12          22
Name          Alex
Class            1
Age             16
Test_score      66
dtype: object
0      Alex
1      John
2    Nicole
3    Andrew
4       joe
5       joe
6       joe
7       joe
dtype: object
0     1
1     2
2     3
3     4
4    12
5    12
6    12
7    12
dtype: int64
0    26
1    27
2    27
3    28
4    22
5    22
6    22
7    22
Name: Age, dtype: int64

In [77]:
#Aggregating data 
#we will use this when we want to do data analysis and get a clear understanding of the data we are working with
student_data_1={
    'Name':['Alex','John','Nicole','Andrew','joe','joe'],
    'Class':[1,2,3,4,2,4],
    'Age':[16,17,17,18,12,12]
}
student_data_2={
    'Class':[1,2,3,4,12,12],
    'Test_score':[66,57,37,28,22,22]
}
df_1=pd.DataFrame(student_data_1)
df_2=pd.DataFrame(student_data_2)
#simmilar to working with sql 

df_3=pd.merge(df_1,df_2,on='Class')

#question to be answered mean marks per class
print(df_3)

grouped_by_class=df_3.groupby('Class')
print(grouped_by_class.first())#we will now have our row index as the class instead of what we had before

#now to find the mean Test_score per class
print(grouped_by_class.Test_score.mean())#we will get the mean Test_score per class 

#we can also do a groupby based on multiple columns or attributes

grouped_by_classes=df_3.groupby(['Class','Age'])

print(grouped_by_classes.first())

     Name  Class  Age  Test_score
0    Alex      1   16          66
1    John      2   17          57
2     joe      2   12          57
3  Nicole      3   17          37
4  Andrew      4   18          28
5     joe      4   12          28
         Name  Age  Test_score
Class
1        Alex   16          66
2        John   17          57
3      Nicole   17          37
4      Andrew   18          28
Class
1    66
2    57
3    37
4    28
Name: Test_score, dtype: int64
             Name  Test_score
Class Age
1     16     Alex          66
2     12      joe          57
      17     John          57
3     17   Nicole          37
4     12      joe          28
      18   Andrew          28

In [78]:
pd.crosstab(df_3['Class'],df_3['Age'],margins=True)#the cross tab will allow us to understand how the two columns are related 
#and how the data is actually distributed

Age    12  16  17  18  All
Class
1       0   1   0   0    1
2       1   0   1   0    2
3       0   0   1   0    1
4       1   0   0   1    2
All     2   1   2   1    6

In [79]:
#we can also generate a pivot table just like in excel using pandas dataframes
pd.pivot_table(data=df_3,index=['Class'],values='Test_score')#by default the function will be mean

       Test_score
Class
1              66
2              57
3              37
4              28

In [80]:
#we can also generate a pivot table wrt multiple columns
pd.pivot_table(data=df_3,index=['Class','Age'],values='Test_score')

           Test_score
Class Age
1     16           66
2     12           57
      17           57
3     17           37
4     12           28
      18           28

In [85]:
import numpy as np
#we can also perform muliple aggregations using the aggfunc parameter
pd.pivot_table(data=df_3,index=['Class','Age'],values='Test_score',aggfunc=[np.mean,np.median,min,max])

                mean     median        min        max
          Test_score Test_score Test_score Test_score
Class Age
1     16          66         66         66         66
2     12          57         57         57         57
      17          57         57         57         57
3     17          37         37         37         37
4     12          28         28         28         28
      18          28         28         28         28